
# Подвиг 2. Вводится строка со списком оценок, например:
# 2 неудовлетворительно удовлетворительно хорошо отлично
# Первая цифра - это числовое значение первой оценки. 
# Остальные оценки имеют возрастающие на 1 числа. С помощью генератора словарей необходимо сформировать 
# словарь d, где ключами будут выступать числа, а значениями - слова.
# Например:
# d = {2: 'неудовлетворительно', 3: 'удовлетворительно', 4: 'хорошо', 5: 'отлично'}
# Вывести на экран значение сформированного словаря с ключом 4.
# Sample Input:
# 1 ужасно неудовлетворительно удовлетворительно прилично отлично 13174.20

# in_lst = "1 ужасно неудовлетворительно удовлетворительно прилично отлично".split()
# start_index = int(in_lst.pop(0))
# d = {index: in_lst[index - start_index]  for index in range(start_index, len(in_lst) + start_index)}

# print(d[4])
# print(start_index)


# Подвиг 3. На автомойку в течение квартала заезжали машины. Их гос. номера фиксировались в журнале, следующим образом
# lst_in = ['А323ГД', 'Д456ВВ', 'Б001ББ', 'Д456ВВ', 'С111СС']
# На основе такого списка через генератор множеств сформировать список уникальных машин. 
# На экран вывести число уникальных машин.

# lst_in = ['А323ГД', 'Д456ВВ', 'Б001ББ', 'Д456ВВ', 'С111СС']
# print(len(set(lst_in)))


# Подвиг 4. Вводится текст в одну строчку со словами через пробел. С помощью генератора множеств сформировать 
# множество из уникальных слов без учета регистра и длина которых не менее трех символов. Вывести на экран размер 
# этого множества.

# in_str = "Хижина изба машина и снова хижина машина"
# my_set = {value for value in input().lower().split() if len(value) > 2}
# print(len(my_set))


# Подвиг 5. Вводится текст в одну строчку со словами через пробел. Используя генераторы множеств и словарей, 
# сформировать словарь в формате: {слово_1: количество_1, слово_2: количество_2, ..., слово_N: количество_N}
# То есть, ключами выступают уникальные слова (без учета регистра), а значениями - число их встречаемости в тексте. 
# На экран вывести значение словаря для слова (союза) 'и'. Если такого ключа нет, то вывести 0.
# in_lst = "И что сказать и что сказать и нечего и точка".lower().split()
# my_dict = {value: in_lst.count(value) for value in in_lst}
# print(my_dict['и'] if 'b' in my_dict.keys() else 0)


# Подвиг 6. Вводится список книг книжного магазина в формате:
# <автор 1>:<название 1>
# ...
# <автор N>:<название N>
# Авторы с названиями могут повторяться. Необходимо, используя генераторы, сформировать словарь с именем d вида:
# {'автор 1': {'название 1', 'название 2', ..., 'название M'}, ..., 'автор K': {'название 1', 'название 2', ..., 'название S'}}
# То есть, ключами выступают уникальные авторы, а значениями - множества с уникальными названиями книг соответствующего 
# автора.
# На экран ничего выводить не нужно, только сформировать словарь обязательно с именем d - он, 
# далее будет проверяться в тестах!

lst_in = ['Пушкин: Сказака о рыбаке и рыбке', 
          'Есенин: Письмо к женщине', 
          'Тургенев: Муму', 'Пушкин: Евгений Онегин', 
          'Есенин: Русь']

d = {}
for str_value in lst_in:
    key, value = str_value.split(": ")
    d.setdefault(key, set())
    d[key].add(value)

print(d)
