"""
Подвиг 3. Вводится строка из русских букв и символов пробела. Необходимо ее закодировать азбукой Морзе, 
где каждой букве ставится в соответствие код из точки и тире. 
После каждой закодированной буквы должен стоять пробел (символ окончания кода буквы). 
После последнего кода пробела быть не должно (в конце строки).
"""

alph_morze = {'А': '.-', 'Б': '-...', 'В': '.--', 'Г': '--.', 'Д': ' -..', 'Е': '.', 'Ё': '.',
              'Ж': '...-', 'З': '--..', 'И': '..', 'Й': '.---', 'К': '-.-', 'Л': '.-..', 'М': '--',
              'Н': '-.', 'О': '---', 'П': '.--.', 'Р': '.-.', 'С': '...', 'Т': '-', 'У': '..-',
              'Ф': '..-.', 'Х': '....', 'Ц': '-.-.', 'Ч': '---.', 'Ш': '----', 'Щ': '--.-',
              'Ъ': '--.--', 'Ы': '-.--', 'Ь': '-..-', 'Э': '..-..', 'Ю': '..--', 'Я': '.-.-', ' ': '-...-'
              }
morze_alph = zip(alph_morze.values(), alph_morze.keys())

# как всегда, красота в одну строку, пробел должен быть в словаре.
# [print(morze[i], end=' ') for i in input().upper()]
# print(*[d.get(i) for i in input().upper()])


def heroic_deed_3():
    # in_str = input().upper() # "Сергей Балакирев".upper()
    in_str = "Сергей Балакирев".upper()

    res_str = ""

    for index in range(len(in_str)):
        res_str += alph_morze[in_str[index]] + \
            (" " if index < len(in_str) - 1 else "")

    print(res_str)


def heroic_deed_4():
    pass


if __name__ == "__main__":
    heroic_deed_3()
