

from operator import index


alph_morze = {'А': '.-', 'Б': '-...', 'В': '.--', 'Г': '--.', 'Д': '-..', 'Е': '.',
              'Ж': '...-', 'З': '--..', 'И': '..', 'Й': '.---', 'К': '-.-', 'Л': '.-..', 'М': '--',
              'Н': '-.', 'О': '---', 'П': '.--.', 'Р': '.-.', 'С': '...', 'Т': '-', 'У': '..-',
              'Ф': '..-.', 'Х': '....', 'Ц': '-.-.', 'Ч': '---.', 'Ш': '----', 'Щ': '--.-',
              'Ъ': '--.--', 'Ы': '-.--', 'Ь': '-..-', 'Э': '..-..', 'Ю': '..--', 'Я': '.-.-', ' ': '-...-'
              }
morze_alph = dict(zip(alph_morze.values(), alph_morze.keys()))

# как всегда, красота в одну строку, пробел должен быть в словаре.
# [print(morze[i], end=' ') for i in input().upper()]
# print(*[d.get(i) for i in input().upper()])

"""
Подвиг 3. Вводится строка из русских букв и символов пробела. Необходимо ее закодировать азбукой Морзе, 
где каждой букве ставится в соответствие код из точки и тире. 
После каждой закодированной буквы должен стоять пробел (символ окончания кода буквы). 
После последнего кода пробела быть не должно (в конце строки).
"""


def heroic_deed_3():

    # in_str = input().upper() # "Сергей Балакирев".upper()
    in_str = "Сергей Балакирев".upper()

    res_str = ""

    for index in range(len(in_str)):
        res_str += alph_morze[in_str[index]] + \
            (" " if index < len(in_str) - 1 else "")

    print(res_str)


"""
Подвиг 4. Имеется закодированная строка с помощью азбуки Морзе. Коды разделены между собой пробелом. 
Необходимо ее раскодировать, используя азбуку Морзе из предыдущего занятия. 
Полученное сообщение (строку) вывести на экран.
"""


def heroic_deed_4():
    # in_str = ".-- ... . -...- .-- . .-. -. ---".split()
    print(*[morze_alph[value].lower() for value in input().split()], sep="")


"""
Имеется словарь с наименованиями предметов и их весом (в граммах):
Сергей собирается в поход и готов взвалить на свои хрупкие плечи максимальный вес в N кг (вводится с клавиатуры). 
Он решил класть в рюкзак предметы в порядке убывания их веса (сначала самые тяжелые, затем, все более легкие) так, 
чтобы их суммарный вес не превысил значения N кг. Все предметы даны в единственном экземпляре. 
Выведите список предметов (в строчку через пробел), которые берет с собой Сергей в порядке убывания их веса.
"""
def heroic_deed_7():
    things = {'карандаш': 20, 'зеркальце': 100, 'зонт': 500, 'рубашка': 300, 
          'брюки': 1000, 'бумага': 200, 'молоток': 600, 'пила': 400, 'удочка': 1200,
          'расческа': 40, 'котелок': 820, 'палатка': 5240, 'брезент': 2130, 'спички': 10}
    rev_dict = {value: key for key, value in things.items()}
    weight = int(input()) * 1000
    for index in sorted([key for key in rev_dict.keys()], reverse=True):
        if weight >= index:
            print(rev_dict[index], end=" ")
            weight -= index
        

if __name__ == "__main__":
    heroic_deed_7()
