

# Подвиг 3. Вводятся вещественные числа в одну строчку через пробел. Необходимо на их основе сформировать
# множество s.
# -5.1 -3.0 7.6 10.3 -4.6 2.78

# s = set(map(float, input().split()))
# print(*sorted(s))


# Подвиг 4. Вводится текст в одну строку, слова разделены пробелом.
# Необходимо подсчитать число уникальных слов (без учета регистра) в этом тексте.
# Результат (число уникальных слов) вывести на экран.

# unique_words = set(input().lower().split())
# print(len(unique_words))

# --- не сдано..
# Подвиг 5. Вводится строка, содержащая латинские символы, пробелы и цифры. 
# Необходимо выделить из нее все неповторяющиеся цифры (символы от 0 до 9) и вывести на экран в одну строку 
# через пробел их в порядке возрастания значений. Если цифры отсутствуют, то вывести слово НЕТ.

# Python 3.9.11 - best language!
# lst = set(filter(lambda x: x.isdigit(),  input()))
# print(" ".join(sorted(lst)) if lst else "НЕТ")


# Подвиг 6. В ночном клубе фиксируется список гостей. Причем гости могут выходить из помещения, 
# а затем, снова заходить. Тогда их имена фиксируются повторно. На вход программы поступает такой список 
# (каждое имя записано с новой строки). Требуется подсчитать общее число гостей, которые посетили ночной клуб. 
# Полагается, что гости имеют уникальные имена. На экран вывести общее число гостей клуба.

# lst_in = ['Мария', 'Елена', 'Екатерина', 'Александр', 'Елена', 'Мария']
# print(len(set(lst_in)))


# Подвиг 7. В аккаунте youtube Сергея прокомментировали очередное видео. Некоторые посетители оставляли несколько 
# комментариев. Требуется по списку комментариев определить уникальное число комментаторов. Комментарии поступают 
# на вход программы в формате:
# имя 1: комментарий 1
# имя 2: комментарий 2

# lst_in = ['EvgeniyK: спасибо большое!', 'LinaTroshka: лайк и подписка!', 'Sergey Karandeev: крутое видео!', 
#           'Евгений Соснин: обожаю', 'EvgeniyK: это повтор?', 'Sergey Karandeev: нет, это новое видео']
# s = set([value.split(": ")[0] for value in lst_in])
# print(s)


# Подвиг 8. Пользователь с клавиатуры вводит названия городов, пока не введет букву q. 
# Определить общее уникальное число городов, которые вводил пользователь. На экран вывести это число. 
# Из коллекций при реализации программы использовать только множества.

lst_in = set(iter(input, 'q'))
print(len(lst_in))