
# # Подвиг 9. Имеется двумерный кортеж, размером 5 x 5 элементов:
# t = ((1, 0, 0, 0, 0),
#      (0, 1, 0, 0, 0),
#      (0, 0, 1, 0, 0),
#      (0, 0, 0, 1, 0),
#      (0, 0, 0, 0, 1))
# # Вводится натуральное число N (N < 5). Необходимо на основе кортежа t сформировать новый аналогичный кортеж
# # t2 размером N x N элементов. Результат вывести на экран в виде таблицы чисел.
# in_len = int(input())
# t2 = ()
# for index in range(in_len):
#     t2 = t2 + (t[index][:in_len],)
# [print(*value) for value in t2]


# Подвиг 10. Вводятся пункты меню (каждый пункт с новой строки) в формате:
# название_1 URL-адрес_1
# название_2 URL-адрес_2
# Необходимо эту информацию представить в виде вложенного кортежа menu в формате:
# ((название_1, URL-адрес_1), (название_2, URL-адрес_2), ... (название_N, URL-адрес_N))
# Результат вывести на экран в виде кортежа командой:
# print(menu)


# lst_in = list(map(str.strip, sys.stdin.readlines()))
# lst_in = ['Главная home', 'Python learn-python', 'Java learn-java', 'PHP learn-php']
# my_tuple = tuple(tuple(value.split()) for value in lst_in)

# print(my_tuple)
