# точка старта продолжения https://stepik.org/lesson/811743/step/7?unit=815018
'''
Известно, что на обработку одного квадратного метра панели требуется 1г сульфида. 
Всего необходимо обработать N прямоугольных панелей размером A на B метров. 
Вам необходимо подсчитать, сколько всего сульфида необходимо на обработку всех панелей. 
И не забудьте, что панели требуют обработки с обеих сторон.

На вход программе подаются 3 положительных целых числа N,A,B в одну строку
Решение:
n, a, b = map(int, input().split()) 
print(2 * n * (a * b))
'''

'''
Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. 
Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов, 
а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

Входные данные
Поступает одно натуральное число S – общее количество сделанных журавликов.

Выходные данные
В единственную строку нужно вывести три числа, разделенных пробелами – количество журавликов, 
которые сделал каждый ребенок (Петя, Катя и Сережа).
print(n := int(input()) // 6, n * 4, n) красивое решение
мое решение, нужно всетаки расписывать переменные
man = int(input()) // 6
woman = (man + man) * 2
print (man, woman, man, man) 
'''