
d_0 = 0
"""
Подвиг 2. На вход программы подается целое десятичное число. Используя битовые операции, включите третий бит введенного числа.
Выведите на экран полученное числовое значение.

"""
# in_value = int(input()) # 100
# in_value |= 0b1000
# print(in_value)

"""
Подвиг 3. На вход программы подается целое десятичное число. Используя битовые операции, выключите 4-й и 1-й биты введенного числа.
Выведите на экран полученное числовое значение.
"""
# in_value = int(input()) # 100
# in_value ^= (1 << 4)
# print(in_value)
# print(bin((1 << 4)))
#  Правильный ответ:
# print(int(input()) & 0b11101101)

"""
Подвиг 4. На вход программы подается целое десятичное число. Используя битовые операции, переключите 3-й и 0-й биты введенного числа.
Выведите на экран полученное числовое значение.
"""
# in_value = int(input())
# print(in_value ^ 9)

"""
Подвиг 5. На вход программы подается целое десятичное число. Используя битовые операции, выполните умножение введенного числа на 4.
Результат отобразите на экране.
"""
# print(int(input()) >> 1)

"""
Подвиг 7. Вводится зашифрованное слово.
Шифрование кодов символов этого слова было проведено с помощью битовой операции XOR с ключом key=123.
То есть, каждый символ был преобразован по алгоритму:
x = ord(x) ^ key
Здесь ord - функция, возвращающая код символа x. Расшифруйте введенное слово и выведите его на экран.
P. S. Подсказка: для преобразования кода в символ используйте функцию chr.
Sample Input:  ѩкю[щюлцхZ
Sample Output: Все верно!
"""
# print("".join([chr(ord(x) ^ 123) for x in input()]))

"""
Подвиг 8. На вход программы подается целое десятичное число. Используя битовые операции,
проверьте, включен ли 6-й и 3-й биты введенного числа.
Если они оба включены, то выведите слово ДА, иначе - слово НЕТ.
"""
# print("ДА" if 72 == 72 & int(input()) else "НЕТ")

"""
Подвиг 9. На вход программы подается целое десятичное число. Используя битовые операции,
проверьте, включен ли 5-й или 1-й биты введенного числа.
Если включен хотя бы один из этих битов, то выведите слово ДА, иначе - слово НЕТ.
"""
in_val = int(input()) & 0b100010
print("ДА" if int(input()) & 0b100010 > 0 else "НЕТ")