# https://stepik.org/lesson/54762/step/2?unit=37456
# 1.1 Предел функции
# https://github.com/Xelerezex/learning-space/blob/3d7ff912088c9e602f2becd4522b8b97e7f9c109/stepik-courses/stepik-practice-python-math/04-seminar-2/5.2-seminar-homework-2/step-02/main.py

"""
Вводится список названий городов в одну строчку через пробел. Перебрать все эти названия
с помощью цикла for и определить, начинается ли название следующего города на последнюю букву
предыдущего города в списке. Если последними встречаются буквы 'ь', 'ъ', 'ы', то берется следующая с конца буква.
Вывести на экран ДА, если последовательность удовлетворяет этому правилу и НЕТ - в противном случае.
Москва Астрахань Новгород Димитровград Душанбе
"""


in_str = "Барабанщик бил бой в барабан"


if __name__ == "__main__":
    # in_str = input()
