# Реализуйте функцию likes(), которая создает систему лайков, как в различных социальных сетях.
#  Функция должна принимать список с именами людей, которые оценили некоторую запись,
#  и возвращать строку в соответствии с примерами ниже:
#
# print(likes([]))                                      # Никто не оценил данную запись
# print(likes(['Тимур']))                               # Тимур оценил данную запись
# print(likes(['Тимур', 'Артур']))                      # Тимур и Артур оценили данную запись
# print(likes(['Тимур', 'Артур', 'Руслан']))            # Тимур, Артур и Руслан оценили данную запись
# print(likes(['Тимур', 'Артур', 'Руслан', 'Анри']))    # Тимур, Артур и 2 других оценили данную запись

# def likes(in_list:list)-> str:
#     if len(in_list) == 0:
#         return "Никто не оценил данную запись"
#     elif len(in_list) == 1:
#         return f"{in_list[0]} оценил данную запись"
#     elif len(in_list) == 2:
#         return f"{' и '.join(in_list)} оценили данную запись"
#     elif len(in_list) == 3:
#         return f"{in_list[0]}, {' и '.join(in_list[1:])} оценили данную запись"
#     else:
#         return f"{', '.join(in_list[:2])} и {len(in_list) - 2} других оценили данную запись"
#
#
# # тест
# print(likes([]))                                      # Никто не оценил данную запись
# print(likes(['Тимур']))                               # Тимур оценил данную запись
# print(likes(['Тимур', 'Артур']))                      # Тимур и Артур оценили данную запись
# print(likes(['Тимур', 'Артур', 'Руслан']))            # Тимур, Артур и Руслан оценили данную запись
# print(likes(['Тимур', 'Артур', 'Руслан', 'Анри']))    # Тимур, Артур и 2 других оценили данную запись

"""
6
испанский, португальский, эсперанто, французский
французский, испанский, эсперанто
португальский, эсперанто, французский, испанский
французский, английский, болгарский, испанский, эсперанто
эсперанто, английский, русский, испанский, французский
python, испанский, эсперанто, латышский, польский, французский
Sample Output 1:
испанский, французский, эсперанто
"""


# all_in = []
# result = []
# for _ in range(int(input())):
#     all_in.append(input().replace(",", "").split())
#
# for language in all_in[0]:
#     language_in = []
#     for list_lang in all_in[1:]:
#         language_in.append(language in list_lang)
#
#     if all(language_in):
#         result.append(language)
#
# print(", ".join(result) if len(result) else "Сериал снять не удастся")

# Напишите программу, которая находит все схожие слова для заданного слова.
# Слова называются схожими, если имеют одинаковое количество и расположение гласных букв.
# При этом сами гласные могут различаться.
# Примечание 1. После последней гласной в начальном и проверяемом слове может быть любое
# количество согласных.
# Примечание 2. В русском языке 10 гласных букв (а, у, о, ы, и, э, я, ю, ё, е) и
# 21 согласная буква (б, в, г, д, ж, з, й, к, л, м, н, п, р, с, т, ф, х, ц, ч, ш, щ).


# def count_char(word: str) -> list:
#     chars = "ауоыиэяюёе"
#     res_list = []
#     for index in range(len(word)):
#         if word[index] in chars:
#             res_list.append(index)
#
#     return res_list
#
#
# in_word = input()
# stamp = count_char(in_word)
#
# for _ in range(int(input())):
#     word = input()
#     if count_char(word) == stamp:
#         print(word)
#
# # for word in words:
# #     w_stamp = count_char(word)
# #     if w_stamp == stamp:
# #         print(word)

