# пробный формат, каждое задание отдельная функция, хотя мне кажется, что отдельный файл, лучше.
'''
2.2 "Сырые" строки / Raw strings 
https://stepik.org/lesson/629522/step/1?unit=625399

В этом курсе мы будем использовать сырые строки.
Чтобы строка стала «сырой», перед ней необходимо поставить символ r в любом регистре:
common_string = 'C:\file.txt' # Обычная строка
raw_string = r'C:\file.txt' # Сырая строка
В такой строке отключается экранирование. Это значит, что обратный слеш считается самостоятельным символом.
Основное применение сырых строк – работа с регулярными выражениями.
'''
def raw_strins_01(value):    
    print(f'{value} * {value} = {value * value}')    

def main():
    common_string = 'C:\file.txt' # Обычная строка
    raw_string = r'C:\file.txt' # Сырая строка



if __name__ == "__main__":
    value = int(input())
    raw_strins_01(1)
    raw_strins_01(100)
    raw_strins_01(5)
    raw_strins_01(36)
    
    print('Ok!')

