# 1 Импортируйте модуль numpy как np
import numpy as np
# 1 Импортируйте модуль numpy как np


# 2 Выведите на печать версию модуля numpy, используемую в текущий момент в песочнице Stepik.
print(np.__version__)
# 2 Выведите на печать версию модуля numpy, используемую в текущий момент в песочнице Stepik.


# 3.1 Считайте число n. Создайте в переменной Z Numpy вектор из нулей длины n.
Z = np.array([0.0] * int(input()))
# 3.1 Считайте число n. Создайте в переменной Z Numpy вектор из нулей длины n.

# 3.2 Считайте строку, где значения заданы через пробел shape и dtype
# Последнее значение в строке может быть либо числом (тогда это последнее значение кортежа shape, либо строкой dtype)
args = input().split()
try:
    Z = np.zeros(tuple(map(int, args)))
except ValueError:
    Z = np.zeros(tuple(map(int, args[:-1])), args[-1])
# 3.2


# 4 Посчитайте размер матрицы Z в байтах и выведите его на печать.
# Sample Input 1:
# np.zeros((10,10))
print(np.prod(Z.shape) * Z.itemsize)
# 4 Посчитайте размер матрицы Z в байтах и выведите его на печать.


