
"""doc."""
# 4  Цикл while
# 4.1 Знакомство с циклом while

"""У Васи есть n пар носков. Утром каждого дня, собираясь в школу, Вася должен надеть пару носков. 
Вечером, прийдя со школы, Вася снимает надетые носки и выбрасывает их. 
Каждый m-й день (в дни с номерами m,2m,3m,...) мама покупает Васе одну пару носков. 
Она делает это поздно вечером, поэтому Вася может надеть новые носки не раньше следующего дня. 
На сколько подряд идущих дней Васе хватит носков?"""
"""
Начнем с того что все начинается с 0 дня После он тратит по 1 паре носков (1 носок в day если так проще будет) 
После каждый М дней мама покупает +1 пару носков 
Для этого достаточно внутри цикла использовать if и проверять остаток от деления day на М и если оно равно 0 
то прибавляем +1 носок Получается что то вроде 
Инпут Дни = 0 While n<=1 Тут минус 1 носок Дни + 1 If day%m==0 Носок + 1 
Надеюсь объяснил достаточно легко без спойлеров по решению)
"""

n, m = map(int, input().split())
