'''
Бандиты Гарри и Ларри отдыхали на природе. Решив пострелять, они выставили на бревно несколько банок из-под кока-колы 
(не больше 10). Гарри начал простреливать банки по порядку, начиная с самой левой, Ларри — с самой правой. 
В какой-то момент получилось так, что они одновременно прострелили одну и ту же последнюю банку.

Гарри возмутился и сказал, что Ларри должен ему кучу денег за то, что тот лишил его удовольствия прострелить несколько 
банок. В ответ Ларри сказал, что Гарри должен ему еще больше денег по тем же причинам. Они стали спорить кто кому сколько 
должен, но никто из них не помнил сколько банок было в начале, а искать простреленные банки по всей округе было неохота. 
Каждый из них помнил только, сколько банок прострелил он сам.
Определите по этим данным, сколько банок не прострелил Гарри и сколько банок не прострелил Ларри.
Sample Input 1:
4 7
Sample Output 1:
6 3
'''
garry, larry = map(int, input().split())


# '''
# Даны значения двух моментов времени, принадлежащих одним и тем же суткам: часы, минуты и секунды 
# для каждого из моментов времени. Известно, что второй момент времени наступил не раньше первого. 
# Определите, сколько секунд прошло между двумя моментами времени.
# Входные данные:
# Программа на вход получает три целых числа: часы, минуты, секунды, задающие первый момент времени 
# и три целых числа, задающих второй момент времени.
# Sample Input 1:
# 1
# 1
# 1
# 2
# 2
# 2
# Выходные данные
# Выведите число секунд между этими моментами времени.
# Sample Output 1:
# 3661
# '''
# # start_sec = int(input()) * 60 * 60 + int(input()) * 60 + int(input())
# # stop_sec = int(input()) * 60 * 60 + int(input()) * 60 + int(input())
# # print(stop_sec - start_sec)
# print(abs((int(input()) * 60 * 60 + int(input()) * 60 + int(input())) - (int(input()) * 60 * 60 + int(input()) * 60 + int(input()))))


# '''
# Напишите программу, которая вычисляет средний балл ученика за решение четырех задач по введенным оценкам (числа от 2 до 5).
# Оценки вводятся в одну строку, могут быть только целые числа от 2 до 5
# '''
# list_balls = list(map(int, input().split()))
# print(sum(list_balls) / len(list_balls))

# '''
# Известно, что на обработку одного квадратного метра панели требуется 1г сульфида. 
# Всего необходимо обработать N прямоугольных панелей размером A на B метров. Вам необходимо подсчитать, 
# сколько всего сульфида необходимо на обработку всех панелей. 
# И не забудьте, что панели требуют обработки с обеих сторон.
# На вход программе подаются 3 положительных целых числа N,A,B
# Sample Input:
# 5 2 3
# Sample Output:
# 60
# '''
# n, a, b = map(int, input().split())
# print(a * b * n * 2)
# # all_p = (a * b * 2) * n


# '''
# Однажды, посетив магазин канцелярских товаров, Вася купил X карандашей, Y ручек и Z фломастеров. 
# Известно, что цена ручки на 2 рубля больше цены карандаша и на 7 рублей меньше цены фломастера. 
# Также известно, что стоимость карандаша составляет 3 рубля. Требуется определить общую стоимость покупки.
# X карандашей
# Y ручек 
# Z фломастеров
# '''
# x, y, z = map(int, input().split())
# cost_x = 3
# cost_y = cost_x + 2
# cost_z = cost_y + 7
# print(sum([cost_x * x, cost_y * y, cost_z * z]))



# '''
# Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. 
# Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов, 
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
# 0 Петя
# 1 Катя
# 2 Сережа
# '''
# all = int(input())
# kat = all // 3 * 2
# pet = int(all // 3 / 2)
# ser = int(pet)
# print(pet, kat, ser)